module FormImp( //создаем модуль с именем FormImp
input logic clk, reset, //устанавливаем входы
output logic [7:0]GPIO //и выходы
);
logic [3:0] i; //создаем регистр 4 бит для хранения
				//состояния счетчика
logic [15:0] X; //создаем регистр 16 бит для хранения
				//состояния дешифратора
always_ff@(posedge clk, posedge reset) //создаем счетчик
begin
if(reset) i = 4'b0000;
else i = i + 4'b0001;
end
always_comb 	//создаем дешифратор
begin
case(i)
4'b0000: X = 16'b0000000000000001;
4'b0001: X = 16'b0000000000000010;
4'b0010: X = 16'b0000000000000100;
4'b0011: X = 16'b0000000000001000;
4'b0100: X = 16'b0000000000010000;
4'b0101: X = 16'b0000000000100000;
4'b0110: X = 16'b0000000001000000;
4'b0111: X = 16'b0000000010000000;
4'b1000: X = 16'b0000000100000000;
4'b1001: X = 16'b0000001000000000;
4'b1010: X = 16'b0000010000000000;
4'b1011: X = 16'b0000100000000000;
4'b1100: X = 16'b0001000000000000;
4'b1101: X = 16'b0010000000000000;
4'b1110: X = 16'b0100000000000000;
4'b1111: X = 16'b1000000000000000;
endcase
end
always_ff@(posedge X[0], posedge X[8]) //входы триггера подключаем
										//к 0-му
begin 									//и 8-му выходу дешифратора
if (X[0]) GPIO[0] <= 1; 		//установка
else if (X[8]) GPIO[0] <= 0; 	//сброс
end
always_ff@(posedge X[1], posedge X[9]) //входы триггера подключаем
										//к 1-му
begin 									//и 9-му выходу дешифратора
if (X[1]) GPIO[1] <= 1; //установка
else if (X[9]) GPIO[1] <= 0; //сброс
end
always_ff@(posedge X[2], posedge X[10]) //входы триггера подключаем
										//к 2-му и10-му
begin 									//выходу дешифратора
if (X[2]) GPIO[2] <= 1; //установка
else if (X[10]) GPIO[2] <= 0; //сброс
end
always_ff@(posedge X[3], posedge X[11]) //входы триггера подключаем
										//к 3-му и 11-му
begin									 //выходу дешифратора
if (X[3]) GPIO[3] <= 1; //установка
else if (X[11]) GPIO[3] <= 0; //сброс
end
always_ff@(posedge X[4], posedge X[12]) //входы триггера подключаем
										//к 4-му и 12-му
begin 									// выходу дешифратора
if (X[4]) GPIO[4] <= 1; //установка
else if (X[12]) GPIO[4] <= 0; //сброс
end
always_ff@(posedge X[5], posedge X[13]) //входы триггера подключаем
										//к 5-му и 13-му
begin 									// выходу дешифратора
if (X[5]) GPIO[5] <= 1; //установка
else if (X[13]) GPIO[5] <= 0; //сброс
end
always_ff@(posedge X[6], posedge X[14]) //входы триггера подключаем
										//к 6-му и 14-му
begin 									//выходу дешифратора
if (X[6]) GPIO[6] <= 1; //установка
else if (X[14]) GPIO[6] <= 0; //сброс
end
always_ff@(posedge X[7], posedge X[15]) //входы триггера подключаем
										//к 7-му и 15-му
begin 									// выходу дешифратора
if (X[7]) GPIO[7] <= 1; //установка
else if (X[15]) GPIO[7] <= 0; //сброс
end
endmodule //конец модуля